let reS = '';

reS += '^'; // начало строки
reS += 'https?'; // обязательный протокол (с опциональным символом 's' в конце)
reS += '\\:\\/\\/'; // протокол последовательность символов ://
reS += '(w{3}\\.){0,1}'; // 0 или 1 раз повторяющаяся последовательность из 3 символов 'w', заканчивающаяся точкой

reS += '(?:'; // опциональная группа без захвата
reS += '[a-zа-я0-9]{1,63}\\.'; // доменное имя третьего уровня длиной от 1 до 63 символов, заканчивающееся точкой
reS += ')?'; //

reS += '[a-zа-я0-9]'; // первый символ имени домена второго уровня - последовательность символов букв, цифр, исключен знак тире
reS += '[a-zа-я0-9\\-]{0,61}'; // последовательность символов букв, цифр и тире длиной от 0 до 61
reS += '[a-zа-я0-9]'; // последний (второй из двух) символ имени домена второго уровня - последовательность символов букв, цифр, исключен знак тире
reS += '\\.'; // точка, отделяющая домен второго уровня от домена верхнего уровня
reS += '[a-zа-я]{2,18}'; // домен верхнего уровня длиной минимум 2 символа, максимум 18 символов (длиннее не нашел)

reS += '(?:'; // группа без захвата с предопределенным количеством повторов
reS += '\\/?'; // необязательный слеш перед частью пути к ресурсу
reS += '[.a-zа-я0-9_\\-\\/]*'; // название части пути к ресурсу
reS += ')+?'; // закрываю группу захвата
reS += '$'; // конец строки

module.exports = new RegExp(reS, 'i'); // ! нечувствительность к регистру в флаге 'i'
